# Итоговая работа. Часть 1
# Блок 1: Ввод и вывод данных
# Дата: 10.0.2026

# Задание 1. Какая команда используется для вывода (печати) данных?
# Ответ: print()

# Задание 2. Выберите все подходящие ответы из списка

# print('Просто текст...") - неверно, разные кавычки
# print() - верно
# print("I'm a math teacher and a programmer!") - верно
# print("3.1415") - верно
# print('I'm 16 and I'm from Northern Ireland.') - неверно, кавычки и апостроф одинаковы, компьютер это не читает
# print('Поэма "Мёртвые души" одна из самых интересных') - верно

# Задание 3. Выберите все подходящие ответы из списка

# print('Python', 'is the best', '!!')
# print("раз", "два, "три")
# print("10", '100', '1000)
# print("Python", , "is the best")

# Задание 4. Что покажет приведённый ниже код?

print('1', '2', '3', '4', sep='*')

# Ответ: 1*2*3*4


# Задание 5. Выберите все подходящие ответы из списка

# print("The world's a little blurry", "Or maybe it's my eyes", end='!!!', sep=' :) ') - верно
# print("Remember not to get too close to stars", end=="") - неверно, нет пробела
# print("Honey, what's your hurry", end='?') - верно
# print("Told you not to worry", "But maybe that's a lie", sep=' :) ') - верно
# print("Remember not to get too close to stars", "They're never gonna give you love like ours", sepp=" ") - неверно, ошибка в слове sep


# Задание 6. Какая команда используется для считывания данных с клавиатуры?
# Ответ: input()

# Задание 7. Какая из указанных строк считывает целое число в переменную n?
# Ответ: n = int(input())

# Задание 8. Выберите верные утверждения.

# Имя переменной не должно совпадать с ключевым (зарезервированным) словом - верно
# Имя переменной не может оканчиваться цифрой - неверно, может
# Имя переменной может начинаться с символа подчёркивания (_) - верно
# Имя переменной не может начинаться с цифры - верно


# Задание 9. Что покажет приведённый ниже код?

s = 13
k = -5
d = s + 2
s = d
k = 2 * s
print(s + k + d)
# Ответ:60


# Задание 10. Что покажет приведённый ниже код?

a = 17 // (23 % 7)
b = 34 % a * 5 - 29 % 4 * 3
print(a * b)

# Ответ: 56