# Итоговая работа. Блок 2: Условный оператор
# Дата: 20.09.2026

# Задача 1: Напишите программу, которая определяет, оканчивается ли год с данным номером на два нуля. Если год оканчивается, то выведите «YES» (без кавычек), иначе выведите «NO» (без кавычек).
year = int(input())

if year % 100 == 0:
    print('YES')
else:
    print('NO')

# Задача 2: Заданы две клетки шахматной доски. Напишите программу, которая определяет, имеют ли указанные клетки один цвет или нет. Если они покрашены в один цвет, то выведите слово «YES» (без кавычек), а если в разные цвета, то «NO» (без кавычек).
a, b, c, d = int(input()), int(input()), int(input()), int(input())
if (a + b + c + d) % 2== 0:
    print('YES')
else:
    print('NO')

# Задача 3: Футбольная команда набирает девочек от 10 до 15 лет включительно. Напишите программу, которая запрашивает возраст и пол претендента, используя для обозначения пола буквы «m» (от male – мужчина) и «f» (от female – женщина), и определяет, подходит ли претендент для вступления в команду или нет. Если претендент подходит, то выведите «YES» (без кавычек), иначе выведите «NO» (без кавычек).
year = int(input())
sex = input()           
if 10<=year<=15 and sex == 'f':
    print('YES')
else:
    print('NO')

# Задача 4: Напишите программу, которая считывает целое число и выводит соответствующую ему римскую цифру. Если число находится вне диапазона [1;10], то программа должна вывести текст «ошибка» (без кавычек).
a = int(input("Введите число от 1 до 10:"))

if 1 <= a <= 10:
    if a == 1:
        print('I')
    elif a == 2:
        print('II')
    elif a == 3:
        print('III')
    elif a == 4:
        print('IV')
    elif a == 5:
        print('V')
    elif a == 6:
        print('VI')
    elif a == 7:
        print('VII')
    elif a == 8:
        print('VIII')
    elif a == 9:
        print('IX')
    elif a == 10:
        print('X')
else:
    print('ошибка')

# Задача 5: Напишите программу, которая принимает на вход число и в зависимости от условий выводит текст «YES» (без кавычек) либо «NO»   Условия: 1.если число нечётное, то вывести «YES»; 
#                    2. если число чётное в диапазоне от 2 до 5 (включительно), то вывести «NO»; 
#                    3. если число чётное в диапазоне от 6 до 20 (включительно), то вывести «YES»; 
#                    4. если число чётное и больше 20, то вывести «NO».  
a =int(input())
if not (a % 2 == 0):
    print('YES')
elif 2<=a<=5:
    print('NO')
elif 6<=a<=20:
    print('YES')
elif a>20:
    print('NO')

# Задача 6: Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли слон попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки ходом слона можно попасть во вторую, или «NO» в противном случае.
 x1, y1, x2, y2 = int(input()), int(input()), int(input()), int(input()), 

if x1 + y1 == x2 + y2 or x1 - y1 == x2 - y2:
    print("YES")
else:
    print("NO")

# Задача 7: Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли конь попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки ходом коня можно попасть во вторую, или «NO» в противном случае.
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())

if (x1 - x2) ** 2 + (y1 - y2) ** 2 == 5:
    print("YES")
else:
    print("NO")

# Задача 8:Даны две различные клетки шахматной доски. Напишите программу, которая определяет, может ли ферзь попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», если из первой клетки ходом ферзя можно попасть во вторую, или «NO» в противном случае.
x1 = int(input())
y1 = int(input())
x2 = int(input())
y2 = int(input())

# Проверяем: вертикаль ИЛИ горизонталь ИЛИ диагональ
if x1 == x2 or y1 == y2 or (x1 - x2) ** 2 == (y1 - y2) ** 2:
    print("YES")
else:
    print("NO")